In [36]:
import numpy as np
import pandas as pd

In [60]:
df = pd.DataFrame({"A": [1, 2, np.nan, 4],
                  "B": [5, np.nan, np.nan, 8],
                  "C": [10, 20, 30, 40]})

In [61]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  NaN  NaN  30
3  4.0  8.0  40

In [62]:
df.fillna(df.mean())

          A    B   C
0  1.000000  5.0  10
1  2.000000  6.5  20
2  2.333333  6.5  30
3  4.000000  8.0  40

In [63]:
df.dropna(axis=1, thresh=3)

     A   C
0  1.0  10
1  2.0  20
2  NaN  30
3  4.0  40

In [64]:
df.fillna(value="Fill Value")

            A           B   C
0         1.0         5.0  10
1         2.0  Fill Value  20
2  Fill Value  Fill Value  30
3         4.0         8.0  40

In [65]:
df["A"] = df["A"].fillna(value=0)

In [66]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  NaN  20
2  0.0  NaN  30
3  4.0  8.0  40

In [67]:
df["B"] = df["B"].fillna(value=df["B"].mean())

In [68]:
df

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40

In [69]:
df.fillna(df.mean())

     A    B   C
0  1.0  5.0  10
1  2.0  6.5  20
2  0.0  6.5  30
3  4.0  8.0  40